#+title: Operators - Practice
#+AUTHOR: [yourName] (pledged)
#+startup: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :comments both
** Solution:

Input:
#+begin_src bash :results output :exports both
  echo "125 5" > input
  cat input
#+end_src

#+RESULTS:
: 125 5

#+begin_src C :main no :includes :cmdline <input
  #include <stdio.h>

  int main() {
    int a, b;
    printf("Enter two numbers: ");
    scanf("%d%d", &a, &b);
    printf("%d %d\n",a,b);

    printf("%d + %d = %d\n", a, b, a + b);
    printf("%d - %d = %d\n", a, b, a - b);
    printf("%d * %d = %d\n", a, b, a * b);
    printf("%d / %d = %d\n", a, b, a / b);
    printf("%d %% %d = %d\n", a, b, a % b);

    return 0;
  }
#+end_src

** Solution:
#+begin_src C :main no :includes :tangle ../src/boolean_solution.c
  #include <stdio.h>

  int main() {
    int x = 1, y = 0, z = 5;

    printf("%d ? %d\n", x && y, 0);  // XX: replace by what you expect
    printf("%d ? %d\n", x || y, 1);
    printf("%d ? %d\n", x == y, 0);
    printf("%d ? %d\n", !x, 0);
    printf("%d ? %d\n", z > x && y < z, 1);

    return 0;
  }
#+end_src

#+RESULTS:
: 0 ? 0
: 1 ? 1
: 0 ? 0
: 0 ? 0
: 1 ? 1

** *Solution:*
#+begin_src C :main no :includes :cmdline < input :tangle ascii.c
  #include <stdio.h>

  int main(void)
  {
    char c1, c2;
    scanf("%c %c", &c1, &c2);

    printf("The ASCII value of %c is %d.\n", c1, c1);
    printf("The ASCII value of %c is %d.\n", c2, c2);
    return 0;
  }
#+end_src

#+RESULTS:
: The ASCII value of b is 98.
: The ASCII value of B is 66.

- Testing:
#+begin_src bash :results output :exports both
  gcc ascii.c -o ascii
  ./ascii < input
#+end_src

#+RESULTS:
: The ASCII value of b is 98.
: The ASCII value of B is 66.

- Input file:
  #+begin_src bash :results output :exports both
    echo "b B" > input
    cat input
  #+end_src

  #+RESULTS:
  : b B
* TODO Checking for a range of values

1) Create a C file =range.c= that defines three integer variables =i=, =m=,
   and =n=, gets their values from the keyboard, and checks if the input
   value for =i= is in the interval =[m,n)=.

2) Source code:
   #+begin_src C :main no :includes :tangle range.c :cmdline < input
     #include <stdio.h>

     int main(void)
     {
       int i, m, n;
       scanf("%d %d %d", &i, &m, &n);

       if (m <= i && i < n)
         printf("%d is in the interval [%d,%d).\n", i, m, n);
       else
         printf("%d is NOT in the interval [%d,%d).\n", i, m, n);

       return 0;
     }
   #+end_src

   #+RESULTS:
   : 11 is NOT in the interval [0,10).

3) Compile =range.c=, rename the object file =range=, and run it with the
   sample values: 5, 0, 10 for i, m, n - testing if 5 is in [0,10).

4) Run =range= for different input values:

   | i = -5 | m = 0 | n = 10 |
   | i = 11 | m = 0 | n = 10 |
   | i = 0  | m = 0 | n = 10 |
   | i = 10 | m = 0 | n = 10 |

5) How would you change the condition to check if the input variable =i=
   is outside of [m,n) ?

** Solution:
   #+begin_src C :main no :includes :tangle range.c :cmdline < input
     #include <stdio.h>

     int main(void)
     {
       int i, m, n;
       scanf("%d %d %d", &i, &m, &n);

       if (i < m || n <= i)
         printf("%d is NOT in the interval [%d,%d).\n", i, m, n);
       else
         printf("%d is in the interval [%d,%d).\n", i, m, n);

       return 0;
     }
   #+end_src

   #+RESULTS:
   : 5 is in the interval [0,10).

-----
Testing:
#+begin_src bash :results output :exports both
  echo "5 0 10" > input
  cat input
#+end_src

#+RESULTS:
: 5 0 10
* TODO Chained expression

In C, the expression =i < j < k= is perfectly legal but it does NOT
check if =j= is between =i= and =k=, =i= \in =(i,k)=.

The relational operator =<= is evaluated from the left: =i < j= is
computed. It is either =1= (=TRUE=) or =0= (=FALSE=).

Next, =0 < k= or =1 < k= is checked.

1) Create a file =chain.c= with the following code, compile and run it:
   #+begin_src C :main no :includes
     #include <stdio.h>

     int main(void)
     {
       int i = 5, j = 1, k = 100;

       if (i < j < k)
          printf("TRUE: %d < %d < %d\n", i, j, k);
       else
          printf("NOT TRUE: %d < %d < %d\n", i, j, k);

       return 0;
     }
   #+end_src

   #+RESULTS:
   : TRUE: 5 < 1 < 100

2) Fix the code so that the output is correct. Then test it for
   different values of =i=, =j=, =k=.

** Solution:
#+begin_src C :main no :includes :includes :tangle chain.c :cmdline < input
     #include <stdio.h>

     int main(void)
     {
       int i = 5, j = 1, k = 100;

       if (i < j && j < k)
          printf("TRUE: %d < %d < %d\n", i, j, k);
       else
          printf("NOT TRUE: %d < %d < %d\n", i, j, k);

       return 0;
     }
#+end_src

#+RESULTS:
: NOT TRUE: 5 < 1 < 100

Testing:
#+begin_src bash :results output :exports both
  gcc chain.c -o chain
  ./chain
#+end_src

#+RESULTS:
: NOT TRUE: 5 < 1 < 100

With input:
#+begin_src C :main no :includes :includes :tangle chain.c :cmdline < input
  #include <stdio.h>

  int main(void)
  {
    int i,j,k;
    scanf("%d %d %d",&i,&j,&k);

    if (i < j && j < k)
       printf("TRUE: %d < %d < %d\n", i, j, k);
    else
       printf("NOT TRUE: %d < %d < %d\n", i, j, k);

    return 0;
  }
#+end_src

#+RESULTS:
: NOT TRUE: 1 < 5 < -100

Input file:
#+begin_src bash :results output :exports both
echo "1 5 -100" > input
cat input
#+end_src

#+RESULTS:
: 1 5 -100
